[
  {
    "id": "1",
    "nombre": "Bienes Raíces",
    "descripcion": "Proyecto desarrollado utilizando la arquitectura Modelo-Vista-Controlador (MVC). Se implementaron herramientas como GULP para la automatización de tareas, así como opciones de contacto mediante e-mail y teléfono. El diseño utiliza la librería Btrap para asegurar una interfaz atractiva y receptiva. El proyecto es completamente administrable e incluye operaciones de Crear, Leer, Actualizar y Borrar (CRUD) que interactúan con una base de datos SQL. Además, se realizó la sanitización de datos y se utilizó una clase maestra que hereda funciones y métodos a las nuevas clases. El enfoque del proyecto es facilitar la venta y renta de propiedades e inmuebles, cumpliendo con los requerimientos estéticos y funcionales del cliente.",
    "imagen": "/build/img/bienesraices.webp",
    "tecnologias": [
      "html",
      "js",
      "btrap",
      "sql",
      "php",
      "css",
      "sass"
    ],
    "info": "",
    "link": "http://jaycode-bienesraices-mvc.domcloud.io/"
  },
  {
    "id": "10",
    "nombre": "DevCamp",
    "descripcion": "Aplicacion administrable, consultas a bases de datos SQL, registro de cuentas, login con jerarquías, datos sanitizados, validación de formularios e implementación de MÉTODO DE PAGO PAYPAL. Una convención con ponentes, agrega, edita y elimina sus nombres, imágenes, redes sociales a través de la arquitectura MODEL VIEW CONTROLLER. Confirmación de E-mail. Esta es una versión DUMMY funcional, pruébala tú mismo:\n<span class=\"naranja\">invitado: invitado@correo.com password: password / admin: correo@correo.com password: password</span>\nTecnologias aplicadas: ",
    "imagen": "/build/img/devcamp.webp",
    "tecnologias": [
      "html",
      "css",
      "js",
      "sql",
      "php",
      "sass",
      "btrap"
    ],
    "info": "",
    "link": "https://jaycode404-devcamp.000webhostapp.com"
  },
  {
    "id": "2",
    "nombre": "AppSalon",
    "descripcion": "Aplicación para cliente de la rama de belleza, totalmente administrable, crea citas, crea servicios, editar y eliminarlos. Contacto por email disponible, validacion de formularios entre otras funcionalidades requeridas por el cliente. Implementacion de la arquitectura Model View Controller en PHP. Toda la informacion traida desde una base de datos y API.",
    "imagen": "/build/img/appsalon.webp",
    "tecnologias": [
      "btrap",
      "js",
      "php",
      "sql",
      "html",
      "css",
      "sass"
    ],
    "info": "",
    "link": "http://jaycode-appsalon-mvc.domcloud.io/"
  },
  {
    "id": "3",
    "nombre": "UpTask",
    "descripcion": "Administracion de proyectos, creacion de tareas personalizadas, buscador, filtros, para llevar un track de las tareas diarias o cualquier proyecto como recordatorio, CRUD completo implementando base de datos SQL y PHP.",
    "imagen": "/build/img/uptask.webp",
    "tecnologias": [
      "js",
      "btrap",
      "php",
      "sql",
      "html",
      "css",
      "sass"
    ],
    "info": "",
    "link": "http://jaycode-uptask-mvc.domcloud.io/"
  },
  {
    "id": "4",
    "nombre": "Festival De Musica",
    "descripcion": "Front End manipulado con Javascript, diseñando un sitio web para un evento musical, poniendo en practica la manipulacion del DOM con javascrip, imagenes escalables, galeria interactiva y funcionalidades de CSS avanzadas",
    "imagen": "/build/img/festivalmusica.webp",
    "tecnologias": [
      "js",
      "html",
      "css",
      "sass"
    ],
    "info": "",
    "link": "https://miprimerfestivaldemusica.netlify.app/"
  },
  {
    "id": "5",
    "nombre": "Geek Store",
    "descripcion": "CRUD completo implementando el uso de API's, la tienda geek que muestra productos de diferentes categorias para el cliente, así tambien como un area administrable donde se pueden agregar, actualizar y eliminar productos, asignarles, precio, imagen, categoria, etc. Puedes probarla, user: admin, password: admin123",
    "imagen": "/build/img/geekstore.webp",
    "tecnologias": [
      "js",
      "html",
      "css",
      "btrap",
      "sass"
    ],
    "info": "",
    "link": "https://vermillion-horse-b13a61.netlify.app/"
  },
  {
    "id": "6",
    "nombre": "Encriptador",
    "descripcion": "Proyecto de manipulacion del DOM con javascript, funcionalidad de copiado y encriptacion/desencriptacion del texto introducido por el usuario",
    "imagen": "/build/img/encriptador.png",
    "tecnologias": [
      "html",
      "js",
      "css",
      "sass"
    ],
    "info": "",
    "link": "https://silver-dragon-162967.netlify.app"
  },
  {
    "id": "7",
    "nombre": "Tienda de ropa",
    "descripcion": "Front End de tienda online, haciendo uso de funcionalidades CSS como FLEXBOX y GRID, interfaz profesional y personalisable a los requerimientos del cliente",
    "imagen": "/build/img/tiendaropa.webp",
    "tecnologias": [
      "html",
      "css",
      "sass"
    ],
    "info": "",
    "link": "https://lucent-biscuit-b44925.netlify.app/"
  },
  {
    "id": "8",
    "nombre": "Blog De Café",
    "descripcion": "Interfaz Front End de blog personal de cafe, un sitio, simple, minimalista y personalizado a los requerimientos del cliente, con seccion sobre la empresa, cursos y contacto",
    "imagen": "/build/img/cafeblog.webp",
    "tecnologias": [
      "html",
      "css",
      "sass"
    ],
    "info": "",
    "link": "https://jacobscoffeblog.netlify.app/"
  },
  {
    "id": "9",
    "nombre": "FreeLancer",
    "descripcion": "Página web de contacto como freelancer, ventajas de trabajar con el cliente, implementacion de secciones informativas, contacto, etc.",
    "imagen": "/build/img/freelancer.webp",
    "tecnologias": [
      "html",
      "css"
    ],
    "info": "",
    "link": "https://myfirstwebpagehtml.netlify.app/"
  }
]